Revit 2024 API
ConnectionValidationInfo Class
 This object contains information about fabrication connection validations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class ConnectionValidationInfo : IDisposable
Visual Basic
Public Class ConnectionValidationInfo _
	Implements IDisposable
Visual C++
public ref class ConnectionValidationInfo : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ConnectionValidationInfo
See Also
ConnectionValidationInfo Members
Autodesk.Revit.DB Namespace